Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.inspector.plan.retrieval.rerank.completedFormat
source: Reranked %1$lld of %2$lld candidates
ar: أُعيد ترتيب %1$lld من %2$lld مرشح
de: %1$lld von %2$lld Kandidaten neu bewertet
es: Reordenados %1$lld de %2$lld candidatos
fr: %1$lld sur %2$lld candidats reclassés
id: Memeringkat ulang %1$lld dari %2$lld kandidat
it: Riordinati %1$lld di %2$lld candidati
ja: %2$lld件中%1$lld件を再ランク
ko: 후보 %2$lld개 중 %1$lld개 재순위화됨
nl: %1$lld van %2$lld kandidaten herordend
pl: Przesortowano %1$lld z %2$lld kandydatów
pt_br: Reclassificados %1$lld de %2$lld candidatos
ru: Переранжировано %1$lld из %2$lld кандидатов
tr: %1$lld / %2$lld aday yeniden sıralandı
uk: Переранжовано %1$lld з %2$lld кандидатів
vi: Đã sắp xếp lại %1$lld trên %2$lld ứng viên
zh_hans: 已重排 %1$lld / %2$lld 个候选
zh_hant: 已重排 %1$lld / %2$lld 個候選

# rag.workspace.inspector.plan.retrieval.rerank.disabled
source: Disabled
ar: معطل
de: Deaktiviert
es: Deshabilitado
fr: Désactivé
id: Dinonaktifkan
it: Disabilitato
ja: 無効
ko: 비활성화
nl: Uitgeschakeld
pl: Wyłączone
pt_br: Desativado
ru: Отключено
tr: Devre dışı
uk: Вимкнено
vi: Đã tắt
zh_hans: 未启用
zh_hant: 未啟用

# rag.workspace.inspector.plan.retrieval.rerank.fallback
source: Failed; kept fusion order
ar: فشل؛ تم الاحتفاظ بترتيب الدمج
de: Fehlgeschlagen; Fusionsreihenfolge beibehalten
es: Falló; se mantuvo el orden de fusión
fr: Échec ; ordre de fusion conservé
id: Gagal; urutan fusi dipertahankan
it: Fallito; mantenuto ordine fusione
ja: 失敗; 融合順を維持
ko: 실패; 퓨전 순서 유지
nl: Mislukt; fusievolgorde behouden
pl: Niepowodzenie; zachowano kolejność fuzji
pt_br: Falhou; manteve a ordem de fusão
ru: Ошибка; сохранён порядок слияния
tr: Başarısız; füzyon sırası korundu
uk: Помилка; збережено порядок злиття
vi: Thất bại; giữ thứ tự hợp nhất
zh_hans: 失败，已保留融合排序
zh_hant: 失敗，已保留融合排序

# rag.workspace.inspector.plan.retrieval.rerank.skipped
source: Skipped
ar: تم التخطي
de: Übersprungen
es: Omitido
fr: Ignoré
id: Dilewati
it: Saltato
ja: スキップ
ko: 건너뜀
nl: Overgeslagen
pl: Pominięte
pt_br: Ignorado
ru: Пропущено
tr: Atlandı
uk: Пропущено
vi: Đã bỏ qua
zh_hans: 已跳过
zh_hant: 已跳過

# rag.workspace.inspector.plan.retrieval.result
source: Final evidence
ar: الأدلة النهائية
de: Endgültige Beweise
es: Evidencia final
fr: Preuves finales
id: Bukti akhir
it: Prove finali
ja: 最終エビデンス
ko: 최종 증거
nl: Definitief bewijs
pl: Ostateczne dowody
pt_br: Evidência final
ru: Итоговые доказательства
tr: Nihai kanıt
uk: Остаточні докази
vi: Bằng chứng cuối cùng
zh_hans: 最终证据
zh_hant: 最終證據

# rag.workspace.inspector.plan.retrieval.resultFormat
source: %1$lld chunks from %2$lld repositories
ar: %1$lld مقطع من %2$lld مستودع
de: %1$lld Blöcke aus %2$lld Repositories
es: %1$lld fragmentos de %2$lld repositorios
fr: %1$lld fragments provenant de %2$lld dépôts
id: %1$lld potongan dari %2$lld repositori
it: %1$lld blocchi da %2$lld repository
ja: %2$lldリポジトリから%1$lldチャンク
ko: %2$lld개 저장소에서 %1$lld개 청크
nl: %1$lld brokken uit %2$lld repositories
pl: %1$lld fragmentów z %2$lld repozytoriów
pt_br: %1$lld trechos de %2$lld repositórios
ru: %1$lld фрагментов из %2$lld репозиториев
tr: %1$lld depodan %2$lld parça
uk: %1$lld фрагментів з %2$lld сховищ
vi: %1$lld đoạn từ %2$lld kho
zh_hans: %1$lld 个分片 · 来自 %2$lld 个仓库
zh_hant: %1$lld 個分片 · 來自 %2$lld 個倉庫

# rag.workspace.inspector.plan.retrieval.sources
source: Enabled sources
ar: المصادر المفعلة
de: Aktivierte Quellen
es: Fuentes habilitadas
fr: Sources activées
id: Sumber yang diaktifkan
it: Fonti abilitate
ja: 有効なソース
ko: 활성화된 소스
nl: Ingeschakelde bronnen
pl: Włączone źródła
pt_br: Fontes ativadas
ru: Включённые источники
tr: Etkin kaynaklar
uk: Увімкнені джерела
vi: Nguồn đã bật
zh_hans: 启用来源
zh_hant: 啟用來源

# rag.workspace.inspector.plan.retrieval.vector
source: Semantic recall
ar: استدعاء دلالي
de: Semantischer Abruf
es: Recuperación semántica
fr: Rappel sémantique
id: Pencarian semantik
it: Richiamo semantico
ja: セマンティック検索
ko: 의미 검색
nl: Semantische herinnering
pl: Wyszukiwanie semantyczne
pt_br: Recuperação semântica
ru: Семантический поиск
tr: Anlamsal geri çağırma
uk: Семантичний пошук
vi: Truy xuất ngữ nghĩa
zh_hans: 语义召回
zh_hant: 語意召回

# rag.workspace.inspector.plan.retrievalFunnel
source: Retrieval funnel
ar: قمع الاسترجاع
de: Abruftrichter
es: Embudo de recuperación
fr: Entonnoir de récupération
id: Corong pengambilan
it: Imbuto di recupero
ja: 検索ファネル
ko: 검색 퍼널
nl: Ophaaltrechter
pl: Lejek wyszukiwania
pt_br: Funil de recuperação
ru: Воронка поиска
tr: Erişim hunisi
uk: Воронка пошуку
vi: Phễu truy xuất
zh_hans: 检索漏斗
zh_hant: 檢索漏斗

# rag.workspace.inspector.plan.scope.knowledgeBase
source: Knowledge Base
ar: قاعدة المعرفة
de: Wissensbasis
es: Base de conocimiento
fr: Base de connaissances
id: Basis Pengetahuan
ja: ナレッジベース
ko: 지식 베이스
nl: Kennisbank
pl: Baza wiedzy
pt_br: Base de Conhecimento
ru: База знаний
tr: Bilgi Tabanı
uk: База знань
vi: Cơ sở tri thức
zh_hans: 知识库
zh_hant: 知識庫

# rag.workspace.inspector.plan.webSearch
source: Web search
ar: بحث الويب
de: Websuche
es: Búsqueda web
fr: Recherche web
id: Pencarian web
it: Ricerca web
ja: ウェブ検索
ko: 웹 검색
nl: Webzoekopdracht
pl: Wyszukiwanie w sieci
pt_br: Busca na web
ru: Веб-поиск
tr: Web araması
uk: Веб-пошук
vi: Tìm kiếm web
zh_hans: 互联网搜索
zh_hant: 網際網路搜尋

# rag.workspace.inspector.plan.webSearchBudgetFormat
source: Up to %lld results
ar: حتى %lld نتيجة
de: Bis zu %lld Ergebnisse
es: Hasta %lld resultados
fr: Jusqu'à %lld résultats
id: Hingga %lld hasil
it: Fino a %lld risultati
ja: 最大%lld件の結果
ko: 최대 %lld개 결과
nl: Tot %lld resultaten
pl: Do %lld wyników
pt_br: Até %lld resultados
ru: До %lld результатов
tr: En fazla %lld sonuç
uk: До %lld результатів
vi: Tối đa %lld kết quả
zh_hans: 最多 %lld 条结果
zh_hant: 最多 %lld 條結果

# rag.workspace.inspector.planCandidateLimit
source: Candidate set
ar: مجموعة المرشحين
de: Kandidatensatz
es: Conjunto de candidatos
fr: Ensemble de candidats
id: Kumpulan kandidat
it: Insieme candidato
ja: 候補セット
ko: 후보 집합
nl: Kandidaatset
pl: Zbiór kandydatów
pt_br: Conjunto de candidatos
ru: Набор кандидатов
tr: Aday kümesi
uk: Набір кандидатів
vi: Tập ứng viên
zh_hans: 候选范围
zh_hant: 候選範圍

# rag.workspace.inspector.planCandidateLimitFormat
source: Review up to %lld candidate repositories
ar: مراجعة حتى %lld مستودع مرشح
de: Bis zu %lld Kandidaten-Repositories prüfen
es: Revisar hasta %lld repositorios candidatos
fr: Examiner jusqu'à %lld dépôts candidats
id: Tinjau hingga %lld repositori kandidat
it: Revisiona fino a %lld repository candidati
ja: 最大%lld件の候補リポジトリをレビュー
ko: 최대 %lld개 후보 저장소 검토
nl: Maximaal %lld kandidaatrepositories beoordelen
pl: Przegląd do %lld repozytoriów kandydackich
pt_br: Revisar até %lld repositórios candidatos
ru: Просмотреть до %lld репозиториев-кандидатов
tr: En fazla %lld aday depoyu incele
uk: Переглянути до %lld кандидатів-сховищ
vi: Xem xét tối đa %lld kho ứng viên
zh_hans: 最多检查 %lld 个候选仓库
zh_hant: 最多檢查 %lld 個候選倉庫

# rag.workspace.inspector.planMode
source: Mode
ar: الوضع
de: Modus
es: Modo
it: Modalità
ja: モード
ko: 모드
nl: Modus
pl: Tryb
pt_br: Modo
ru: Режим
tr: Mod
uk: Режим
vi: Chế độ
zh_hans: 模式
zh_hant: 模式

# rag.workspace.inspector.planMode.filteredSemantic
source: Filtered semantic retrieval
ar: استرجاع دلالي مفلتر
de: Gefilterter semantischer Abruf
es: Recuperación semántica filtrada
fr: Récupération sémantique filtrée
id: Pengambilan semantik terfilter
it: Recupero semantico filtrato
ja: フィルタリングされたセマンティック検索
ko: 필터링된 의미 검색
nl: Gefilterd semantisch ophalen
pl: Filtrowane wyszukiwanie semantyczne
pt_br: Recuperação semântica filtrada
ru: Фильтрованный семантический поиск
tr: Filtrelenmiş anlamsal erişim
uk: Фільтрований семантичний пошук
vi: Truy xuất ngữ nghĩa có lọc
zh_hans: 筛选后语义检索
zh_hant: 篩選後語意檢索

# rag.workspace.inspector.planMode.guidedDiscovery
source: Guided discovery
ar: اكتشاف موجه
de: Geführte Entdeckung
es: Descubrimiento guiado
fr: Découverte guidée
id: Penemuan terpandu
it: Scoperta guidata
ja: ガイド付き発見
ko: 안내 탐색
nl: Begeleide ontdekking
pl: Odkrywanie z przewodnikiem
pt_br: Descoberta guiada
ru: Направляемый поиск
tr: Rehberli keşif
uk: Кероване дослідження
vi: Khám phá có hướng dẫn
zh_hans: 引导提问
zh_hant: 引導提問

# rag.workspace.inspector.planMode.needsClarification
source: Need more details
ar: بحاجة لمزيد من التفاصيل
de: Weitere Details erforderlich
es: Se necesitan más detalles
fr: Plus de détails nécessaires
id: Butuh detail lebih lanjut
it: Servono più dettagli
ja: 詳細が必要
ko: 추가 정보 필요
nl: Meer details nodig
pl: Potrzebne więcej szczegółów
pt_br: Precisa de mais detalhes
ru: Требуются уточнения
tr: Daha fazla ayrıntı gerekli
uk: Потрібні додаткові деталі
vi: Cần thêm chi tiết
zh_hans: 需要补充信息
zh_hant: 需要補充資訊

# rag.workspace.inspector.planMode.semanticOnly
source: Semantic retrieval
ar: استرجاع دلالي فقط
de: Semantischer Abruf
es: Recuperación semántica
fr: Récupération sémantique
id: Pengambilan semantik
it: Recupero semantico
ja: セマンティック検索
ko: 의미 검색
nl: Semantisch ophalen
pl: Wyszukiwanie semantyczne
pt_br: Recuperação semântica
ru: Только семантический поиск
tr: Anlamsal erişim
uk: Семантичний пошук
vi: Truy xuất ngữ nghĩa
zh_hans: 语义检索
zh_hant: 語意檢索

# rag.workspace.inspector.planMode.structuredOnly
source: Structured query
ar: استعلام منظم فقط
de: Strukturierte Abfrage
es: Consulta estructurada
fr: Requête structurée
id: Kueri terstruktur
it: Query strutturata
ja: 構造化クエリ
ko: 구조화된 쿼리
nl: Gestructureerde query
pl: Zapytanie strukturalne
pt_br: Consulta estruturada
ru: Только структурированный запрос
tr: Yapılandırılmış sorgu
uk: Структурований запит
vi: Truy vấn có cấu trúc
zh_hans: 结构化查询
zh_hant: 結構化查詢

# rag.workspace.inspector.planNotes
source: Plan notes
ar: ملاحظات الخطة
de: Planhinweise
es: Notas del plan
fr: Notes du plan
id: Catatan rencana
it: Note del piano
ja: 計画メモ
ko: 계획 노트
nl: Planopmerkingen
pl: Notatki planu
pt_br: Notas do plano
ru: Заметки к плану
tr: Plan notları
uk: Нотатки плану
vi: Ghi chú kế hoạch
zh_hans: 规划说明
zh_hant: 規劃說明

# rag.workspace.inspector.planRemoteBudgetFormat
source: Up to %1$lld repositories · %2$lld items per repository
ar: حتى %1$lld مستودع · %2$lld عنصر لكل مستودع
de: Bis zu %1$lld Repositories · %2$lld Elemente pro Repository
es: Hasta %1$lld repositorios · %2$lld elementos por repositorio
fr: Jusqu'à %1$lld dépôts · %2$lld éléments par dépôt
id: Hingga %1$lld repositori · %2$lld item per repositori
it: Fino a %1$lld repository · %2$lld elementi per repository
ja: 最大%1$lldリポジトリ · リポジトリあたり%2$lld項目
ko: 최대 %1$lld개 저장소 · 저장소당 %2$lld개 항목
nl: Tot %1$lld repositories · %2$lld items per repository
pl: Do %1$lld repozytoriów · %2$lld elementów na repozytorium
pt_br: Até %1$lld repositórios · %2$lld itens por repositório
ru: До %1$lld репозиториев · %2$lld элементов на репозиторий
tr: En fazla %1$lld depo · depo başına %2$lld öğe
uk: До %1$lld сховищ · %2$lld елементів на сховище
vi: Tối đa %1$lld kho · %2$lld mục mỗi kho
zh_hans: 最多 %1$lld 个仓库 · 每仓库 %2$lld 条
zh_hant: 最多 %1$lld 個倉庫 · 每倉庫 %2$lld 條

# rag.workspace.inspector.planSort
source: Prioritization
ar: تحديد الأولوية
de: Priorisierung
es: Priorización
fr: Priorisation
id: Prioritas
it: Priorità
ja: 優先順位付け
ko: 우선순위
nl: Prioritering
pl: Priorytetyzacja
pt_br: Priorização
ru: Приоритизация
tr: Önceliklendirme
uk: Пріоритетність
vi: Ưu tiên
zh_hans: 优先顺序
zh_hant: 優先順序

# rag.workspace.inspector.planSort.ascending
source: ascending
ar: تصاعدي
de: aufsteigend
es: ascendente
fr: croissant
id: menaik
it: crescente
ja: 昇順
ko: 오름차순
nl: oplopend
pl: rosnąco
pt_br: crescente
ru: по возрастанию
tr: artan
uk: за зростанням
vi: tăng dần
zh_hans: 升序
zh_hant: 升序

# rag.workspace.inspector.planSort.descending
source: descending
ar: تنازلي
de: absteigend
es: descendente
fr: décroissant
id: menurun
it: decrescente
ja: 降順
ko: 내림차순
nl: aflopend
pl: malejąco
pt_br: decrescente
ru: по убыванию
tr: azalan
uk: за спаданням
vi: giảm dần
zh_hans: 降序
zh_hant: 降序

# rag.workspace.inspector.planSort.forks
source: forks
ar: التفرعات
id: fork
it: fork
ja: フォーク数
ko: 포크
pl: forki
ru: форки
tr: çatal sayısı
uk: форки
vi: số fork
zh_hans: Fork 数
zh_hant: Fork 數

# rag.workspace.inspector.planSort.libraryUpdatedAt
source: library added date
ar: تاريخ إضافة المكتبة
de: Hinzufügedatum der Bibliothek
es: fecha de adición a la biblioteca
fr: date d'ajout à la bibliothèque
id: tanggal ditambahkan ke perpustakaan
it: data aggiunta libreria
ja: ライブラリ追加日
ko: 라이브러리 추가 날짜
nl: bibliotheek toevoegdatum
pl: data dodania biblioteki
pt_br: data de adição à biblioteca
ru: дата добавления в библиотеку
tr: kütüphaneye eklenme tarihi
uk: дата додавання до бібліотеки
vi: ngày thêm vào thư viện
zh_hans: 加入知识库时间
zh_hant: 加入知識庫時間

# rag.workspace.inspector.planSort.pushedAt
source: repository update date
ar: تاريخ تحديث المستودع
de: Aktualisierungsdatum des Repository
es: fecha de actualización del repositorio
fr: date de mise à jour du dépôt
id: tanggal pembaruan repositori
it: data aggiornamento repository
ja: リポジトリ更新日
ko: 저장소 업데이트 날짜
nl: repository updatdatum
pl: data aktualizacji repozytorium
pt_br: data de atualização do repositório
ru: дата обновления репозитория
tr: depo güncelleme tarihi
uk: дата оновлення сховища
vi: ngày cập nhật kho
zh_hans: 仓库更新时间
zh_hant: 倉庫更新時間

# rag.workspace.inspector.planSort.repoCreatedAt
source: repository creation date
ar: تاريخ إنشاء المستودع
de: Erstellungsdatum des Repository
es: fecha de creación del repositorio
fr: date de création du dépôt
id: tanggal pembuatan repositori
it: data creazione repository
ja: リポジトリ作成日
ko: 저장소 생성 날짜
nl: repository aanmaakdatum
pl: data utworzenia repozytorium
pt_br: data de criação do repositório
ru: дата создания репозитория
tr: depo oluşturma tarihi
uk: дата створення сховища
vi: ngày tạo kho
zh_hans: 仓库创建时间
zh_hant: 倉庫建立時間

# rag.workspace.inspector.planSort.starredAt
source: starred date
ar: تاريخ التنجيم
de: Sterndatum
es: fecha de estrellado
fr: date de mise en favori
id: tanggal dibintangi
it: data stellina
ja: スター追加日
ko: 별표 표시 날짜
nl: sterdatum
pl: data oznaczenia gwiazdką
pt_br: data de favorito
ru: дата добавления в избранное
tr: yıldızlanma tarihi
uk: дата зірочки
vi: ngày gắn sao
zh_hans: 收藏时间
zh_hant: 收藏時間

# rag.workspace.inspector.planSort.stars
source: star count
ar: عدد النجوم
de: Sternanzahl
es: cantidad de estrellas
fr: nombre d'étoiles
id: jumlah bintang
it: numero stelle
ja: スター数
ko: 별표 수
nl: aantal sterren
pl: liczba gwiazdek
pt_br: contagem de estrelas
ru: количество звёзд
tr: yıldız sayısı
uk: кількість зірок
vi: số sao
zh_hans: Star 数
zh_hant: Star 數

# rag.workspace.inspector.planStatus
source: Status
ar: الحالة
es: Estado
fr: Statut
it: Stato
ja: ステータス
ko: 상태
ru: Статус
tr: Durum
uk: Статус
vi: Trạng thái
zh_hans: 状态
zh_hant: 狀態

# rag.workspace.inspector.planStatus.awaitingClarification
source: Waiting for more details
ar: بانتظار المزيد من التفاصيل
de: Warte auf weitere Details
es: Esperando más detalles
fr: En attente de plus de détails
id: Menunggu detail lebih lanjut
it: In attesa di dettagli
ja: 詳細待ち
ko: 추가 정보 대기 중
nl: Wachten op meer details
pl: Oczekiwanie na więcej szczegółów
pt_br: Aguardando mais detalhes
ru: Ожидание уточнений
tr: Daha fazla ayrıntı bekleniyor
uk: Очікування додаткових деталей
vi: Đang chờ thêm chi tiết
zh_hans: 等待补充信息
zh_hant: 等待補充資訊

# rag.workspace.inspector.retrievalScore
source: Retrieval score
ar: درجة الاسترجاع
de: Abrufwertung
es: Puntuación de recuperación
fr: Score de récupération
id: Skor pengambilan
it: Punteggio di recupero
ja: 検索スコア
ko: 검색 점수
nl: Ophaalscore
pl: Wynik wyszukiwania
pt_br: Pontuação de recuperação
ru: Оценка поиска
tr: Erişim puanı
uk: Оцінка пошуку
vi: Điểm truy xuất
zh_hans: 综合检索分
zh_hant: 綜合檢索分

# rag.workspace.inspector.retrievalScore.actualCalculation
source: Calculation with this citation's inputs
ar: الحساب باستخدام مدخلات هذا الاقتباس
de: Berechnung mit den Eingaben dieses Zitats
es: Cálculo con las entradas de esta cita
fr: Calcul avec les entrées de cette citation
id: Perhitungan dengan masukan kutipan ini
it: Calcolo con gli input di questa citazione
ja: この引用の入力で計算
ko: 이 인용의 입력으로 계산
nl: Berekening met de invoer van deze citatie
pl: Obliczenia z danymi wejściowymi tego cytatu
pt_br: Cálculo com as entradas desta citação
ru: Расчёт с входными данными этой цитаты
tr: Bu alıntının girdileriyle hesaplama
uk: Розрахунок з вхідними даними цього цитування
vi: Tính toán với đầu vào của trích dẫn này
zh_hans: 本次引用的实际计算
zh_hant: 本次引用的實際計算

# rag.workspace.inspector.retrievalScore.actualCalculationUnavailable
source: This older citation does not retain its retrieval inputs, so it cannot be recalculated exactly.
ar: هذا الاقتباس الأقدم لا يحتفظ بمدخلات الاسترجاع، لذا لا يمكن إعادة حسابه بدقة.
de: Dieses ältere Zitat behält seine Abrufeingaben nicht, daher kann es nicht exakt neu berechnet werden.
es: Esta cita más antigua no conserva sus entradas de recuperación, por lo que no se puede recalcular exactamente.
fr: Cette citation plus ancienne ne conserve pas ses entrées de récupération, elle ne peut donc pas être recalculée exactement.
id: Kutipan lama ini tidak menyimpan masukan pengambilannya, sehingga tidak dapat dihitung ulang secara tepat.
it: Questa citazione più vecchia non conserva i suoi input di recupero, quindi non può essere ricalcolata esattamente.
ja: この古い引用は検索入力を保持していないため、正確に再計算できません。
ko: 이 이전 인용은 검색 입력을 보존하지 않으므로 정확히 재계산할 수 없습니다.
nl: Deze oudere citatie behoudt de ophaalinvoer niet, dus kan niet exact worden herberekend.
pl: Ten starszy cytat nie zachowuje swoich danych wejściowych wyszukiwania, więc nie można go dokładnie przeliczyć.
pt_br: Esta citação mais antiga não retém suas entradas de recuperação, portanto não pode ser recalculada exatamente.
ru: Эта более старая цитата не сохраняет свои входные данные поиска, поэтому её нельзя точно пересчитать.
tr: Bu eski alıntı, erişim girdilerini saklamadığı için tam olarak yeniden hesaplanamaz.
uk: Це старіше цитування не зберігає вхідні дані пошуку, тому його не можна точно перерахувати.
vi: Trích dẫn cũ này không lưu giữ đầu vào truy xuất, nên không thể tính lại chính xác.
zh_hans: 该历史引用未保留当时的检索参数，无法精确复算。
zh_hant: 該歷史引用未保留當時的檢索參數，無法精確複算。

# rag.workspace.inspector.retrievalScore.cosine
source: Cosine similarity: the raw semantic similarity between the question and this chunk.
ar: تشابه جيب التمام: التشابه الدلالي الخام بين السؤال وهذا المقطع.
de: Kosinus-Ähnlichkeit: die rohe semantische Ähnlichkeit zwischen der Frage und diesem Block.
es: Similitud coseno: la similitud semántica bruta entre la pregunta y este fragmento.
fr: Similarité cosinus : la similarité sémantique brute entre la question et ce fragment.
id: Kemiripan kosinus: kemiripan semantik mentah antara pertanyaan dan potongan ini.
it: Similarità coseno: la similarità semantica grezza tra la domanda e questo blocco.
ja: コサイン類似度：質問とこのチャンクの生の意味的類似度。
ko: 코사인 유사도: 질문과 이 청크 간의 원시 의미 유사도입니다.
nl: Cosinusovereenkomst: de ruwe semantische gelijkenis tussen de vraag en dit brok.
pl: Podobieństwo cosinusowe: surowe podobieństwo semantyczne między pytaniem a tym fragmentem.
pt_br: Similaridade de cosseno: a similaridade semântica bruta entre a pergunta e este trecho.
ru: Косинусное сходство: необработанное семантическое сходство между вопросом и этим фрагментом.
tr: Kosinüs benzerliği: soru ile bu parça arasındaki ham anlamsal benzerlik.
uk: Косинусна подібність: сира семантична подібність між запитанням і цим фрагментом.
vi: Tương đồng cosine: độ tương đồng ngữ nghĩa thô giữa câu hỏi và đoạn này.
zh_hans: 余弦相似度：问题与该分片的原始语义相似度。
zh_hant: 餘弦相似度：問題與該分片的原始語義相似度。

# rag.workspace.inspector.retrievalScore.explanationTitle
source: Retrieval score
ar: درجة الاسترجاع
de: Abrufwertung
es: Puntuación de recuperación
fr: Score de récupération
id: Skor pengambilan
it: Punteggio di recupero
ja: 検索スコア
ko: 검색 점수
nl: Ophaalscore
pl: Wynik wyszukiwania
pt_br: Pontuação de recuperação
ru: Оценка поиска
tr: Erişim puanı
uk: Оцінка пошуку
vi: Điểm truy xuất
zh_hans: 综合检索分说明
zh_hant: 綜合檢索分說明

# rag.workspace.inspector.retrievalScore.formula.hybrid
source: score = (keyword RRF + keyword score × 0.12 + vector RRF + cosine similarity × 0.20) × source weight + preferred-repo boost
ar: الدرجة = (RRF الكلمات المفتاحية + درجة الكلمات المفتاحية × 0.12 + RRF المتجهات + تشابه جيب التمام × 0.20) × وزن المصدر + تعزيز المستودع المفضل
de: Wertung = (Keyword-RRF + Keyword-Wertung × 0,12 + Vektor-RRF + Kosinus-Ähnlichkeit × 0,20) × Quellgewicht + Bevorzugtes-Repo-Boost
es: puntuación = (RRF de palabras clave + puntuación de palabras clave × 0.12 + RRF vectorial + similitud coseno × 0.20) × peso de fuente + incremento de repositorio preferido
fr: score = (RRF mots-clés + score mots-clés × 0,12 + RRF vectoriel + similarité cosinus × 0,20) × poids source + bonus dépôt préféré
id: skor = (RRF kata kunci + skor kata kunci × 0,12 + RRF vektor + kemiripan kosinus × 0,20) × bobot sumber + dorongan repositori pilihan
it: punteggio = (RRF parole chiave + punteggio parole chiave × 0,12 + RRF vettore + similarità coseno × 0,20) × peso fonte + boost repository preferito
ja: スコア = (キーワードRRF + キーワードスコア × 0.12 + ベクトルRRF + コサイン類似度 × 0.20) × ソース重み + 優先リポジトリブースト
ko: 점수 = (키워드 RRF + 키워드 점수 × 0.12 + 벡터 RRF + 코사인 유사도 × 0.20) × 소스 가중치 + 선호 저장소 부스트
nl: score = (trefwoord RRF + trefwoordscore × 0,12 + vector RRF + cosinusovereenkomst × 0,20) × brongewicht + voorkeursrepo-boost
pl: wynik = (RRF słów kluczowych + wynik słów kluczowych × 0,12 + RRF wektorów + podobieństwo cosinusowe × 0,20) × waga źródła + premia za preferowane repozytorium
pt_br: pontuação = (RRF de palavra-chave + pontuação de palavra-chave × 0,12 + RRF vetorial + similaridade de cosseno × 0,20) × peso da fonte + impulso de repositório preferido
ru: оценка = (RRF ключевых слов + оценка ключевых слов × 0,12 + RRF векторов + косинусное сходство × 0,20) × вес источника + бонус предпочтительного репозитория
tr: puan = (anahtar kelime RRF + anahtar kelime puanı × 0.12 + vektör RRF + kosinüs benzerliği × 0.20) × kaynak ağırlığı + tercih edilen depo desteği
uk: оцінка = (RRF ключових слів + оцінка ключових слів × 0.12 + RRF вектора + косинусна подібність × 0.20) × вага джерела + бонус улюбленого сховища
vi: điểm = (RRF từ khóa + điểm từ khóa × 0.12 + RRF vector + tương đồng cosine × 0.20) × trọng số nguồn + thưởng kho ưa thích
zh_hans: 综合检索分 =（关键词 RRF + 字面命中分 × 0.12 + 向量 RRF + 余弦相似度 × 0.20）× 来源权重 + @repo 偏好加成
zh_hant: 綜合檢索分 =（關鍵詞 RRF + 字面命中分 × 0.12 + 向量 RRF + 餘弦相似度 × 0.20）× 來源權重 + @repo 偏好加成
